import { Modal, Group, Button } from "@mantine/core";

const terms = [
  "يضمن فريق إثنين الخصوصية التامة للمريض وعدم الإطلاع على أي تفاصيل شخصية لأي حالة من قبل أي شخص خارج إثنين",
  "الهدف الأول و الأساسي لإثنين هو الحرص على وصول المريض لأفضل نتيجة علاجية وصحية ممكنة عن طريق تدريبه وتأهيله للوصول الى التحكم الذاتي المرن بالالتزام بالمعايير الدوائية و نمط الحياة المناسب  مع  متابعتك لطبيبك المعالج و يجب على متلقي الخدمة التعاون مع الأخصائي لغرض الوصول لهذا الهدف.",
  "الحصول علـــى  خدمة التثقيف و الدعم الصحي أو النفسي للمصاب بما يطلبه متلقي الخدمة  من الاستشارة  بشكل أساسي و بما  يناسب كل حالة على حدة حسب تقييم فريق إثنين الصحي  لكل حالة بشكل فردي  اعتمادا على الأبحاث و الدراسات المعتمدة  من  قبل اثنين من مقدمي الخدمة الصحية المؤهلين حسب تخصصاتهم  وفق خطة مبدئية تعرض لمتلقي الخدمة  حسب أهداف الجلسة التثقيفية و يمكن التعديل بها حسب احتياجات المصاب المتغيرة و موافقة مسؤول الحالة.",
  "تختلف الخطة المقترحة من قبل مسؤولي الحالات حسب كل حالة على حدة و يلتزم فريق إثنين من منفذي الخطة بعدد و كم الجلسات التثقيفية حسب الاتفاق المسبق مع متلقي الخدمة و مسؤول الحالة سواء كان المصاب أو أحد ذويه خلال فترة الاشتراك المتفق عليها.",
  "تكون مدة الجلسة التثقيفية معتمدة بـ ثلاثين الى تسعين دقيقة حسب تقييم مقدم الخدمة  ويحق لمتلقي الخدمة التواصل بالرسائل للمتابعة خلال فترة اشتراكه و يلتزم مقدم الخدمة بالرد عليه خلال هذه الفترة.",
  "يتم توفير مقدمي الرعاية الصحية المناسبين حسب توفرهم  للتواصل مع المصاب  أو ذويه  لتحقيق احتياجات المصاب بالرجوع للخطة المرسومة من قبل مسؤول الحالة.",
  "يعرض محتوى إثنين  صيغ مختلفة ومناسبة لكل حالة على حدة كما يتضمن معلومات ذات طابع عام، وليس الغرض منه ولا يوصى بأن يكون بديلا عن المشورة الطبية المتخصصة ومتابعة الطبيب الخاص بالحالة.",
  "يلتزم متلقي الخدمة سواء كان المصاب أو أحد ذويه بالإفصاح عن أي حالة أو وضع صحي يؤثر على الخطة أو الحالة الصحية العامة للمصاب",
  "جميع استشاراتنا النصية و الصوتية مسجلة و خاضعة لقوانين خصوصية المرضى.",
  "يلتزم متلقي الخدمة بالآداب والسلوكيات العامة و يحق لاثنين إيقاف الخدمة دون أي التزام من قبل اثنين في حال تجاوز متلقي الخدمة لأي من الآداب والسلوكيات العامة المتفق عليها",
  "يُحظر عليك نشر أو إرسال أي مواد غير قانونية أو إباحية أو بها تهديد أو قذف أو تشهير أو فُحش أو تحريض أو تدنيس أو أي مادة يمكن أن تشكل أو تحث على سلوك قد يُعتبر مخالفة جنائية أو ينشأ عنه مسؤولية مدنية أو ينتهك القانون بخلاف ذلك.",
  "يتم توفير مواد تثقيفية ملائمة لوضع المصاب الصحي بالإضافة الجلسات التثقيفية التي تحتوي على النصائح المناسبة لكل حالة على حدة حسب تقييم مسؤول الحالة واعتماد مدير تشغيل الخدمات الطبية.",
  "ينبغي ألا تستخدم محتوى إثنين لتشخيص مشكلة صحية أو مشكلة تتعلق باللياقة البدنية أو مرض. اسع دائما للحصول على المشورة من طبيبك بشأن أي حالة طبية أو علاج طبي. إثنين لا يراد به التشخيص الطبي أو العلاج الطبي. لا تتجاهل أبدا المشورة الطبية أو تتأخر في طلبها.",
  "د تكون هناك بعض الصعوبات التقنية و يعمل فريق إثنين على حلها و يجب الإبلاغ عنها فور ملاحظتها للعمل على تجاوزها.",
  "يحق لاثنين الغاء اشتراك المصاب في حال عدم التجاوب مع مقدمي الخدمة.",
];

function TermsAndService({
  opened,
  open,
  close,
}: {
  opened: boolean;
  open: () => void;
  close: () => void;
}) {
  return (
    <>
      <Modal opened={opened} onClose={close} title="الأحكام و الشروط">
        <ul>
          {terms.map((item, index) => (
            <li key={index.toString()}>
              &#x2022; &ensp;{item} <br></br>
            </li>
          ))}
        </ul>
      </Modal>

      {/* <Group position="center">
          <Button onClick={open}>Open modal</Button>
        </Group> */}
    </>
  );
}

export default TermsAndService;
